app/controllers/login_controller.rb

  def new
    return false unless request.post?

    # 1. Login to reddit
    login = RestClient.post("http://www.reddit.com/api/login", { :user => params[:username], :passwd => params[:password] })

    unless login.cookies.include?("reddit_session")
      redirect_to :action => 'index'
    end

    @user = User.find_or_create_by_username(:username => params[:username])
    @user.reddits = [] # If we're updating, clear all old reddits.

    # 2. Get list of reddits
    raw_reddits = RestClient.get('http://www.reddit.com/reddits/mine/.json', { :cookies => login.cookies })
    json_reddits = JSON.parse(raw_reddits)

    json_reddits["data"]["children"].each do |red|
      r = red["data"]

      # 3. WE HAVE 'DEMS REDDITS!
      # Get each one, linking it to this user & create it if it doesn't yet exist
      reddit = Reddit.find_or_create_by_uid({ :uid => r["id"], :name => r["title"], :url => r["url"] })
---
SELECT * FROM `users` WHERE (`users`.`username` = 'jibbist') LIMIT 1
SELECT `reddits`.* FROM `reddits` INNER JOIN `reddits_users` ON `reddits`.id = `reddits_users`.reddit_id WHERE (`reddits`.`uid` = '2r0ij') AND (`reddits_users`.user_id = 2 ) LIMIT 1
INSERT INTO `users` (`updated_at`, `username`, `created_at`) VALUES('2010-09-03 21:23:54', 'jibbist', '2010-09-03 21:23:54')
INSERT INTO `reddits` (`name`, `updated_at`, `url`, `uid`, `created_at`) VALUES('Official Reddit announcements', '2010-09-03 21:25:41', '/r/announcements/', '2r0ij', '2010-09-03 21:25:41')

  def thanks
    @user = User.find_by_username(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`username` = 'jibbist') LIMIT 1